<?php

namespace Database\Seeders;

use App\Models\Kid;
use App\Models\Fundraising;
use Illuminate\Database\Seeder;

class FirstKidSeeder extends Seeder
{
    public function run(): void
    {
        // 1. Ребенок с активным сбором
        $kid1 = Kid::create([
            'name' => 'Прохор',
            'name_declension' => 'Прохора', // Родительный падеж
            'last_name' => 'Сергеев',
            'history' => 'Сергеев Прохор 10.04.2023 года, живет в Мытищах. Диагнозы: церебральный паралич со спастической диплегией, GMFCS III уровень, ацетабулярная дисплазия с двух сторон, поражение зрительных проводящих путей, сходящееся альтернирующее косоглазие, церебральная лейкомаляция, церебральная атрофия, воронкообразная деформация грудной клетки, вальгусные установки стоп. Идет сбор на занятия в бассейне для Прохора, к сожалению мама одна воспитывает 5-х детей. Сумма для оплаты 10 занятий в бассейне 28 000 рублей.',
            'avatar' => 'default.jpg',
            'is_active' => true,
        ]);

        Fundraising::create([
            'kid_id' => $kid1->id,
            'current_amount' => 0,
            'target_amount' => 28000,
            'is_active' => true,
        ]);

        // 2. Ребенок с закрытым сбором
        $kid2 = Kid::create([
            'name' => 'Маша',
            'name_declension' => 'Маши', // Родительный падеж
            'last_name' => 'Леонтьева',
            'history' => 'СБОР ЗАКРЫТ! Маша Леонтьева 6 лет, г. Москва, диагноз: спинально-мышечная атрофия 1 тип. Для физического развития Маше необходима постоянная реабилитация. Маша постоянно прибавляет в движениях. Сейчас Маша стала вставать на четвереньки, может самостоятельно ходить на коленках и у ребенка есть огромный шанс встать на ноги. Мы боремся за этот шанс!!! Каждому по Вере его будет!!! Мы Верим!!! Сейчас мы ведем сбор на занятия в центре "Адели" г. Москва.',
            'avatar' => 'default.jpg',
            'is_active' => true,
        ]);

        Fundraising::create([
            'kid_id' => $kid2->id,
            'current_amount' => 65400,
            'target_amount' => 65400,
            'is_active' => false, // Сбор закрыт
        ]);
    }
}
