@extends('main')

@section('content')
    <section class="person">

        <div class="container">

            <!-- Заголовок -->
            <div class="row">

                <div class="col-12 text-center">

                    <h2 class="mb-5">
                        История фонда
                    </h2>

                </div>

            </div>

            <!-- Текст -->
            <div class="row">

                <div class="offset-lg-3 col-lg-6 col-12">

                    <div class="person__descr">

                        <p>
                            Фонд «Марии Леонтьевой» зарегистрирован
                            13 ноября 2020 года в министерстве юстиции
                            под учетным номером 7714017510 и создан
                            для помощи детям с генетическими заболеваниями,
                            в том числе с диагнозом спинально-мышечная
                            атрофия (СМА).
                        </p>

                        <p>
                            Идея создания фонда появилась в январе 2020 года —
                            в начале сбора средств для приобретения препарата
                            «Zolgensma» для Марии Леонтьевой.
                        </p>

                        <p>
                            После постановки диагноза родители Маши открыли
                            сбор на покупку лекарства и лечение заболевания
                            спинально-мышечной атрофией у их дочери.
                            Стоимость препарата составила более 150 миллионов рублей.
                        </p>

                        <p>
                            Для оперативного закрытия сбора родители сразу же
                            стали обращаться во все фонды страны с просьбой
                            открыть сбор на данный препарат, но столкнулись
                            с шквалом отказов.
                        </p>

                        <p>
                            Какие-то фонды отказывали по причине непрофильности
                            сбора — собирали на онкологию, ДЦП и другие заболевания.
                            Другие фонды пугались колоссальной суммы сбора.
                            Мошенников в этой сфере, увы, также было немало.
                        </p>

                        <p>
                            Всё это побудило родителей создать свой фонд для того,
                            чтобы честно и открыто помогать детям с такими сложными
                            и тяжёлыми заболеваниями.
                        </p>

                        <p>
                            Сбор средств для Марии был успешно завершён
                            в январе 2021 года, но это не остановило родителей
                            и волонтёров продолжать помогать детям.
                        </p>

                        <p>
                            Наш фонд не тратит средства на зарплаты.
                            Фонд работает только при помощи добрых сердец волонтёров.
                        </p>

                    </div>
                    <!-- /.person__descr -->

                </div>

            </div>

        </div>
        <!-- /.container -->

    </section>
    <!-- /.person -->
@endsection
